drytoastman/esp32player/main/lis2dh12_reg.h
int32_t lis2dh12_high_pass_on_outputs_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t lis2dh12_high_pass_on_outputs_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  LIS2DH12_AGGRESSIVE  = 0,
  LIS2DH12_STRONG      = 1,
  LIS2DH12_MEDIUM      = 2,
  LIS2DH12_LIGHT       = 3,
} lis2dh12_hpcf_t;
int32_t lis2dh12_high_pass_bandwidth_set(const stmdev_ctx_t *ctx,
                                         lis2dh12_hpcf_t val);
int32_t lis2dh12_high_pass_bandwidth_get(const stmdev_ctx_t *ctx,
                                         lis2dh12_hpcf_t *val);

typedef enum
{
  LIS2DH12_NORMAL_WITH_RST  = 0,
  LIS2DH12_REFERENCE_MODE   = 1,
  LIS2DH12_NORMAL           = 2,
  LIS2DH12_AUTORST_ON_INT   = 3,
} lis2dh12_hpm_t;
int32_t lis2dh12_high_pass_mode_set(const stmdev_ctx_t *ctx,
                                    lis2dh12_hpm_t val);
int32_t lis2dh12_high_pass_mode_get(const stmdev_ctx_t *ctx,
                                    lis2dh12_hpm_t *val);

typedef enum
{
  LIS2DH12_2g   = 0,
  LIS2DH12_4g   = 1,
  LIS2DH12_8g   = 2,
  LIS2DH12_16g  = 3,
} lis2dh12_fs_t;
int32_t lis2dh12_full_scale_set(const stmdev_ctx_t *ctx, lis2dh12_fs_t val);
int32_t lis2dh12_full_scale_get(const stmdev_ctx_t *ctx,
                                lis2dh12_fs_t *val);

int32_t lis2dh12_block_data_update_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lis2dh12_block_data_update_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lis2dh12_filter_reference_set(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lis2dh12_filter_reference_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lis2dh12_xl_data_ready_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_xl_data_ovr_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t lis2dh12_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum
{
  LIS2DH12_ST_DISABLE   = 0,
  LIS2DH12_ST_POSITIVE  = 1,
  LIS2DH12_ST_NEGATIVE  = 2,
} lis2dh12_st_t;
int32_t lis2dh12_self_test_set(const stmdev_ctx_t *ctx, lis2dh12_st_t val);
int32_t lis2dh12_self_test_get(const stmdev_ctx_t *ctx, lis2dh12_st_t *val);

typedef enum
{
  LIS2DH12_LSB_AT_LOW_ADD = 0,
  LIS2DH12_MSB_AT_LOW_ADD = 1,
} lis2dh12_ble_t;
int32_t lis2dh12_data_format_set(const stmdev_ctx_t *ctx,
                                 lis2dh12_ble_t val);
int32_t lis2dh12_data_format_get(const stmdev_ctx_t *ctx,
                                 lis2dh12_ble_t *val);

int32_t lis2dh12_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_status_get(const stmdev_ctx_t *ctx,
                            lis2dh12_status_reg_t *val);

int32_t lis2dh12_int1_gen_conf_set(const stmdev_ctx_t *ctx,
                                   lis2dh12_int1_cfg_t *val);
int32_t lis2dh12_int1_gen_conf_get(const stmdev_ctx_t *ctx,
                                   lis2dh12_int1_cfg_t *val);

int32_t lis2dh12_int1_gen_source_get(const stmdev_ctx_t *ctx,
                                     lis2dh12_int1_src_t *val);

int32_t lis2dh12_int1_gen_threshold_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_int1_gen_threshold_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dh12_int1_gen_duration_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lis2dh12_int1_gen_duration_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lis2dh12_int2_gen_conf_set(const stmdev_ctx_t *ctx,
                                   lis2dh12_int2_cfg_t *val);
int32_t lis2dh12_int2_gen_conf_get(const stmdev_ctx_t *ctx,
                                   lis2dh12_int2_cfg_t *val);

int32_t lis2dh12_int2_gen_source_get(const stmdev_ctx_t *ctx,
                                     lis2dh12_int2_src_t *val);

int32_t lis2dh12_int2_gen_threshold_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_int2_gen_threshold_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dh12_int2_gen_duration_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lis2dh12_int2_gen_duration_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  LIS2DH12_DISC_FROM_INT_GENERATOR  = 0,
  LIS2DH12_ON_INT1_GEN              = 1,
  LIS2DH12_ON_INT2_GEN              = 2,
  LIS2DH12_ON_TAP_GEN               = 4,
  LIS2DH12_ON_INT1_INT2_GEN         = 3,
  LIS2DH12_ON_INT1_TAP_GEN          = 5,
  LIS2DH12_ON_INT2_TAP_GEN          = 6,
  LIS2DH12_ON_INT1_INT2_TAP_GEN     = 7,
} lis2dh12_hp_t;
int32_t lis2dh12_high_pass_int_conf_set(const stmdev_ctx_t *ctx,
                                        lis2dh12_hp_t val);
int32_t lis2dh12_high_pass_int_conf_get(const stmdev_ctx_t *ctx,
                                        lis2dh12_hp_t *val);

int32_t lis2dh12_pin_int1_config_set(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg3_t *val);
int32_t lis2dh12_pin_int1_config_get(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg3_t *val);

int32_t lis2dh12_int2_pin_detect_4d_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_int2_pin_detect_4d_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  LIS2DH12_INT2_PULSED   = 0,
  LIS2DH12_INT2_LATCHED  = 1,
} lis2dh12_lir_int2_t;
